# AddVertex3D

## Description
Procedure AddVertex3D adds a 3D vertex to the referenced 3D polygon object.

```pascal
PROCEDURE AddVertex3D(
				objectHd : HANDLE;
				pX,pY,pZ : REAL);
```

```python
def vs.AddVertex3D(objectHd, p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to object.|
|p|REAL|Location of 3D vertex point.|

## See Also
VS Functions:
Add3DPt

## Version
Availability: from MiniCAD6.0

## Category
* Objects - 3D